'use strict';

module.exports = {
    up: (queryInterface, Sequelize) => {
        return queryInterface.bulkInsert('Posts', [{
                id: 1,
                title: 'Някой да има вентил?',
                content: 'Здравейте, търси се вентил за капла, на която се помпа външната гума, няма вътрешна. Моля, за съдействие, ако някой знае нещо по въпроса, ще съм лагодарен! Редакция, извинявам се, не видях, че две теми по надолу има инфо! Но все пак ще съм благодарен ако помогнете',
                createdAt: '2018-03-18 08:19:42',
                updatedAt: '2018-03-18 08:19:50',
                userId: 1,
                ThreadId: 1,
            },
            {
                id: 2,
                title: 'Какво да гледаме когато свършат любимите сериали !!!',
                content: 'Я да се образоваме взаимно и да си намерим алтернативи ;-) Идеята: Събирам всички сериали от сървъра в една обща тема - с линкове, инфо и картинка за всеки сериал.Картинки и прочие дивотии, не искам. Всеки който жела да е включи, да ми драсне на ЛС или да пише в тази тема какви сериали и кои сезони е качвал на сървъра, както и линкове. Желаещите да се включат с превод на инфото или писане на собствено такова за сериалите, да ми пишат ЛС. Най - долу в този пост има списък с преводаческите намерения.',
                createdAt: '2018-03-18 08:19:42',
                updatedAt: '2018-03-18 08:19:50',
                userId: 2,
                ThreadId: 2,
            },
            {
                id: 3,
                title: 'Какво е необходимо за да се обезпечи нормативно възможността за водене на предварителен публичен конституционен дебат в електронен (писмен) вид на страницата на Народното събрание?',
                content: 'Какво е необходимо за да се обезпечи нормативно възможността за водене на предварителен публичен конституционен дебат в електронен (писмен) вид на страницата на Народното събрание? Става въпрос за провеждане на формална дискусия по свободна гражданска инициатива, която да даде предварителна яснота за проблемите в Конституцията от гледна точка на гражданското общество, съответните интереси, претенции, тези и аргументи. И своеобразно проектиране на нов обществен договор, преди внасянето на такива законопроекти в деловодството на Народното събрание, при което да се преодолее както проблемът с прозрачността и гражданското участие, така проблемът с прецизността, излишните емоции и комуникационен шум в дискусиите за проектотекстове, така и да се преодолее анонимността на участващите, характерна за отворените електронни форуми, (например) чрез предварителна регистрация на гише с лична карта и задължителна снимка.\n Според Вас, необходимо ли е да се приема специален закон за организацията на такъв електронен форум или след като става въпрос за архитектурата и съдържанието на сайта на Народното събрание, може да се организира само по волята на ръководството на Парламента? По чия инициатива формално може да се реализира подобна идея?',
                createdAt: '2018-03-18 08:19:42',
                updatedAt: '2018-03-18 08:19:50',
                userId: 3,
                ThreadId: 3,
            },
            {
                id: 4,
                title: 'аз имам един въпрос:',
                content: 'от известно време не бях посещавал сайта www.linux-index.org(от 2-3 седмици някаде).Вчера се замислих и си казах че искам да сложа Линукс и реших да посетя сайта и нейска да влиза вътре.дава ми че няма такъв.Ползвам браузър Mozilla Firefox.Искам да попитам дали може нащо доставчика ми да е олигавил работата или нещо със сървара на сайта ',
                createdAt: '2018-03-18 08:19:42',
                updatedAt: '2018-03-18 08:19:50',
                userId: 3,
                ThreadId: 4,
            }
        ], {});
    },

    down: (queryInterface, Sequelize) => {
        return queryInterface.bulkDelete('Posts', null, {});
    }
};