'use strict';

module.exports = {
    up: (queryInterface, Sequelize) => {
        return queryInterface.bulkInsert('Posts', [{
                id: 1,
                title: 'Някой да има вентил?',
                content: 'Здравейте, търси се вентил за капла, на която се помпа външната гума, няма вътрешна. Моля, за съдействие, ако някой знае нещо по въпроса, ще съм благодарен!',
                createdAt: '2018-03-18 08:19:42',
                updatedAt: '2018-03-18 08:19:50',
                userId: 1,
                ThreadId: 1,
            },
            {
                id: 2,
                title: 'Какво да гледаме когато свършат любимите сериали !!!',
                content: 'Я да се образоваме взаимно и да си намерим алтернативи ;-) Идеята: Събирам всички сериали от сървъра в една обща тема - с линкове, инфо и картинка за всеки сериал.',
                createdAt: '2018-03-18 08:19:42',
                updatedAt: '2018-03-18 08:19:50',
                userId: 2,
                ThreadId: 2,
            },
            {
                id: 3,
                title: 'Какво е необходимо за да се обезпечи нормативно възможността за водене на предварителен публичен конституционен дебат?',
                content: 'По чия инициатива формално може да се реализира подобна идея?',
                createdAt: '2018-03-18 08:19:42',
                updatedAt: '2018-03-18 08:19:50',
                userId: 3,
                ThreadId: 3,
            },
            {
                id: 4,
                title: 'Имам един въпрос:',
                content: 'От известно време не бях посещавал сайта www.linux-index.org(от 2-3 седмици някаде).Вчера се замислих и си казах че искам да сложа Линукс и реших да посетя сайта и не иска да влиза вътре.',
                createdAt: '2018-03-18 08:19:42',
                updatedAt: '2018-03-18 08:19:50',
                userId: 3,
                ThreadId: 4,
            }
        ], {});
    },

    down: (queryInterface, Sequelize) => {
        return queryInterface.bulkDelete('Posts', null, {});
    }
};